coder1-ide-next/load-tests/http-gentle-stress.yml
# Gentle HTTP Session Stress Test
# Lower arrival rates to avoid overwhelming the server
#
# Run with: npx artillery run load-tests/http-gentle-stress.yml

config:
  target: "http://localhost:3001"
  phases:
    # Phase 1: Gradual ramp-up
    - duration: 10
      arrivalRate: 1
      name: "Warm-up"

    # Phase 2: Steady moderate load
    - duration: 20
      arrivalRate: 3
      name: "Moderate Load"

    # Phase 3: Peak burst (gentler)
    - duration: 10
      arrivalRate: 5
      name: "Peak"

    # Phase 4: Cool down
    - duration: 10
      arrivalRate: 1
      name: "Cool Down"

  # Thresholds for passing the test
  ensure:
    p99: 5000
    median: 2000
    maxErrorRate: 5

scenarios:
  - name: "Health Check"
    weight: 4
    flow:
      - get:
          url: "/api/health"
          headers:
            x-trace-id: "trace_health_{{ $timestamp }}"

  - name: "Session Operations"
    weight: 2
    flow:
      - get:
          url: "/api/sessions"
          headers:
            x-trace-id: "trace_sessions_{{ $timestamp }}"
      - think: 1
      - post:
          url: "/api/terminal-rest/sessions"
          headers:
            Content-Type: "application/json"
            x-trace-id: "trace_create_{{ $timestamp }}"
          json:
            sessionId: "gentle-test-{{ $uuid }}"
            _trace:
              traceId: "trace_gentle_{{ $timestamp }}"
              operation: "gentle:session:create"

  - name: "Timeline Check"
    weight: 2
    flow:
      - get:
          url: "/api/timeline"
          headers:
            x-trace-id: "trace_timeline_{{ $timestamp }}"