coder1-ide-next/load-tests/http-session-stress.yml
# HTTP-Based Session Stress Test
# Tests API endpoints without requiring Socket.IO v3 engine
#
# Run with: npx artillery run load-tests/http-session-stress.yml

config:
  target: "http://localhost:3001"
  phases:
    # Phase 1: Gradual ramp-up
    - duration: 15
      arrivalRate: 2
      name: "Warm-up"

    # Phase 2: Steady moderate load
    - duration: 30
      arrivalRate: 5
      name: "Moderate Load"

    # Phase 3: Peak burst
    - duration: 15
      arrivalRate: 15
      name: "Peak Burst"

    # Phase 4: Cool down
    - duration: 15
      arrivalRate: 3
      name: "Cool Down"

  # Thresholds for passing the test
  ensure:
    p99: 3000
    median: 1000
    maxErrorRate: 10

scenarios:
  - name: "Health Check Stress"
    weight: 3
    flow:
      - get:
          url: "/api/health"
          headers:
            x-trace-id: "trace_health_{{ $timestamp }}"

  - name: "Session List and Create"
    weight: 2
    flow:
      # List existing sessions
      - get:
          url: "/api/sessions"
          headers:
            x-trace-id: "trace_session_list_{{ $timestamp }}"

      - think: 1

      # Create a terminal session via REST
      - post:
          url: "/api/terminal-rest/sessions"
          headers:
            Content-Type: "application/json"
            x-trace-id: "trace_session_create_{{ $timestamp }}"
          json:
            sessionId: "load-test-{{ $uuid }}"
            _trace:
              traceId: "trace_load_{{ $timestamp }}"
              operation: "load:session:create"

  - name: "Timeline and Checkpoint Flow"
    weight: 2
    flow:
      # Get timeline events
      - get:
          url: "/api/timeline"
          headers:
            x-trace-id: "trace_timeline_{{ $timestamp }}"

      - think: 0.5

      # Get checkpoints
      - get:
          url: "/api/checkpoint"
          headers:
            x-trace-id: "trace_checkpoint_{{ $timestamp }}"

  - name: "Full Session Lifecycle"
    weight: 1
    flow:
      # Health check
      - get:
          url: "/api/health"

      - think: 0.5

      # List sessions
      - get:
          url: "/api/sessions"

      - think: 0.5

      # Create session
      - post:
          url: "/api/terminal-rest/sessions"
          headers:
            Content-Type: "application/json"
          json:
            sessionId: "lifecycle-{{ $uuid }}"
            _trace:
              traceId: "trace_lifecycle_{{ $timestamp }}"
              operation: "load:lifecycle:create"

      - think: 1

      # Get timeline
      - get:
          url: "/api/timeline"

      - think: 0.5

      # Final health check
      - get:
          url: "/api/health"